TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
/****************************************************************************//*!
*
* @file  	ets.c
*
* @version  1.0.0.0
*
* @date     September-2017
*
* @brief    Electrode touch sense routines for S32K144
*
*******************************************************************************/

/*******************************************************************************
* Includes
*******************************************************************************/
#include "S32K144.h"
#include "main.h"
#include "ets.h"
#include "ts_cfg.h"
#include "filter.h"
#include "timer.h"
#include "gpio.h"
#include "gpio_inline_fcn1.h"
#include "adc.h"
#include "adc_inline_fcn1.h"
#include "slider.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/
// Electrodes status
tElecStatus   electrodesStatus;

// Electrode structure
tElecStruct  elecStruct[NUMBER_OF_ELECTRODES], *pElecStruct;
#if SLIDER_ENABLE
extern tElecStruct  sliderElecStruct[NUMBER_OF_SLIDER_ELECTRODES];
#endif

// Electrode capacitance to equivalent voltage conversion
int16_t   numberOfElectrodeSensingCyclesPerSample;
int32_t   adcDataElectrodeDischargeRaw[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
int16_t   adcDataElectrodeDischargeRawSample[NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_ACTIVE];
int32_t   adcDataElectrodeDischargeRawCalc;
uint8_t   elecNum, elecNumAct, sampleNum;
uint16_t  chargeDistributionPeriod, chargeDistributionPeriodTmp;

// Wake up
uint16_t   electrodeWakeUpActivateCounter;
uint16_t   electrodesVirtualEGSActivateCounter;
extern uint8_t sliderElecNumAct;

// Electrode DC tracker self-trim after power-up or reset
int32_t   adcDataElectrodeDischargeBuffer[NUMBER_OF_ELECTRODES];
uint16_t  adcDataElectrodeDischargeBufferCounter[NUMBER_OF_ELECTRODES];

// DC Tracker
int32_t   DCTrackerDataBufferRaw[NUMBER_OF_ELECTRODES];
int32_t   DCTrackerDataBuffer[NUMBER_OF_ELECTRODES];
uint8_t   DCTrackerDataShift[NUMBER_OF_ELECTRODES];

// LP Filter
tFrac32   LPFilterData[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
#if SLIDER_ENABLE
uint8_t   LPFilterType[NUMBER_OF_ELECTRODES + NUMBER_OF_SLIDER_ELECTRODES];
#else
uint8_t   LPFilterType[NUMBER_OF_ELECTRODES];
#endif
// Detector
int32_t   detectorThresholdTouch[NUMBER_OF_ELECTRODES], detectorThresholdRelease[NUMBER_OF_ELECTRODES];
int16_t   detectorThresholdTouchDelta[NUMBER_OF_ELECTRODES], detectorThresholdReleaseDelta[NUMBER_OF_ELECTRODES];
uint8_t   electrodeTouch[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
uint8_t   electrodesVirtualEGSTouch;

// Touch qualification
uint8_t   electrodeTouchQualified[NUMBER_OF_ELECTRODES];
uint8_t   electrodeTouchQualifiedReport;
uint8_t   electrodeTouchNumberPlusOne;

// Low power mode
extern uint8_t  lowPowerModeCtrl;

// FrequencyHopping
uint8_t   frequencyID,frequencyIDsave;
uint8_t   frequencyHoppingActivation;

// Decimation filter
int32_t   adcDataElectrodeDischargeRawDF[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];

// Oversampling
uint8_t electrodesOversamplingActivationReport;
/*****************************************************************************
 *
 * Function: void ElectrodeStructureInit(void)
 *
 * Description: Electrodes structure init
 *
 *****************************************************************************/
void ElectrodeStructureInit(void)
{
#ifdef ELEC0
	// Load electrode 0 hardware data
	elecStruct[0].adcBasePtr = ELEC0_ADC;
	elecStruct[0].adcChNum = ELEC0_ADC_CHANNEL;
	elecStruct[0].portBasePtr = ELEC0_PORT;
	elecStruct[0].gpioBasePtr = ELEC0_GPIO;
	elecStruct[0].pinNumberElec = ELEC0_ELEC_GPIO_PIN;
	elecStruct[0].pinNumberCext = ELEC0_CEXT_GPIO_PIN;
	elecStruct[0].portMask = ELEC0_PORT_MASK;
	// Load electrode 0 application data
	DCTrackerDataShift[0] = ELEC0_DCTRACKER_FILTER_FACTOR;
	LPFilterType[0] = ELEC0_LPFILTER_TYPE;
	detectorThresholdTouchDelta[0] = ELEC0_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[0] = ELEC0_RELEASE_THRESHOLD_DELTA;
#endif

#ifdef ELEC1
	// Load electrode 1 hardware data
	elecStruct[1].adcBasePtr = ELEC1_ADC;
	elecStruct[1].adcChNum = ELEC1_ADC_CHANNEL;
	elecStruct[1].portBasePtr = ELEC1_PORT;
	elecStruct[1].gpioBasePtr = ELEC1_GPIO;
	elecStruct[1].pinNumberElec = ELEC1_ELEC_GPIO_PIN;
	elecStruct[1].pinNumberCext = ELEC1_CEXT_GPIO_PIN;
	elecStruct[1].portMask = ELEC1_PORT_MASK;
	// Load electrode 1 application data
	DCTrackerDataShift[1] = ELEC1_DCTRACKER_FILTER_FACTOR;
	LPFilterType[1] = ELEC1_LPFILTER_TYPE;
	detectorThresholdTouchDelta[1] = ELEC1_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[1] = ELEC1_RELEASE_THRESHOLD_DELTA;
#endif

#ifdef ELEC2
	// Load electrode 2 hardware data
	elecStruct[2].adcBasePtr = ELEC2_ADC;
	elecStruct[2].adcChNum = ELEC2_ADC_CHANNEL;
	elecStruct[2].portBasePtr = ELEC2_PORT;
	elecStruct[2].gpioBasePtr = ELEC2_GPIO;
	elecStruct[2].pinNumberElec = ELEC2_ELEC_GPIO_PIN;
	elecStruct[2].pinNumberCext = ELEC2_CEXT_GPIO_PIN;
	elecStruct[2].portMask = ELEC2_PORT_MASK;
	// Load electrode 2 application data
	DCTrackerDataShift[2] = ELEC2_DCTRACKER_FILTER_FACTOR;
	LPFilterType[2] = ELEC2_LPFILTER_TYPE;
	detectorThresholdTouchDelta[2] = ELEC2_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[2] = ELEC2_RELEASE_THRESHOLD_DELTA;
#endif

#ifdef ELEC3
	// Load electrode 3 hardware data
	elecStruct[3].adcBasePtr = ELEC3_ADC;
	elecStruct[3].adcChNum = ELEC3_ADC_CHANNEL;
	elecStruct[3].portBasePtr = ELEC3_PORT;
	elecStruct[3].gpioBasePtr = ELEC3_GPIO;
	elecStruct[3].pinNumberElec = ELEC3_ELEC_GPIO_PIN;
	elecStruct[3].pinNumberCext = ELEC3_CEXT_GPIO_PIN;
	elecStruct[3].portMask = ELEC3_PORT_MASK;
	// Load electrode 3 application data
	DCTrackerDataShift[3] = ELEC3_DCTRACKER_FILTER_FACTOR;
	LPFilterType[3] = ELEC3_LPFILTER_TYPE;
	detectorThresholdTouchDelta[3] = ELEC3_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[3] = ELEC3_RELEASE_THRESHOLD_DELTA;
#endif

#ifdef ELEC4
	// Load electrode 4 hardware data
	elecStruct[4].adcBasePtr = ELEC4_ADC;
	elecStruct[4].adcChNum = ELEC4_ADC_CHANNEL;
	elecStruct[4].portBasePtr = ELEC4_PORT;
	elecStruct[4].gpioBasePtr = ELEC4_GPIO;
	elecStruct[4].pinNumberElec = ELEC4_ELEC_GPIO_PIN;
	elecStruct[4].pinNumberCext = ELEC4_CEXT_GPIO_PIN;
	elecStruct[4].portMask = ELEC4_PORT_MASK;
	// Load electrode 4 application data
	DCTrackerDataShift[4] = ELEC4_DCTRACKER_FILTER_FACTOR;
	LPFilterType[4] = ELEC4_LPFILTER_TYPE;
	detectorThresholdTouchDelta[4] = ELEC4_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[4] = ELEC4_RELEASE_THRESHOLD_DELTA;
#endif

#ifdef ELEC5
	// Load electrode 5 hardware data
	elecStruct[5].adcBasePtr = ELEC5_ADC;
	elecStruct[5].adcChNum = ELEC5_ADC_CHANNEL;
	elecStruct[5].portBasePtr = ELEC5_PORT;
	elecStruct[5].gpioBasePtr = ELEC5_GPIO;
	elecStruct[5].pinNumberElec = ELEC5_ELEC_GPIO_PIN;
	elecStruct[5].pinNumberCext = ELEC5_CEXT_GPIO_PIN;
	elecStruct[5].portMask = ELEC5_PORT_MASK;
	// Load electrode 5 application data
	DCTrackerDataShift[5] = ELEC5_DCTRACKER_FILTER_FACTOR;
	LPFilterType[5] = ELEC5_LPFILTER_TYPE;
	detectorThresholdTouchDelta[5] = ELEC5_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[5] = ELEC5_RELEASE_THRESHOLD_DELTA;
#endif

#ifdef ELEC6
	// Load electrode 6 hardware data
	elecStruct[6].adcBasePtr = ELEC6_ADC;
	elecStruct[6].adcChNum = ELEC6_ADC_CHANNEL;
	elecStruct[6].portBasePtr = ELEC6_PORT;
	elecStruct[6].gpioBasePtr = ELEC6_GPIO;
	elecStruct[6].pinNumberElec = ELEC6_ELEC_GPIO_PIN;
	elecStruct[6].pinNumberCext = ELEC6_CEXT_GPIO_PIN;
	elecStruct[6].portMask = ELEC6_PORT_MASK;
	// Load electrode 6 application data
	DCTrackerDataShift[6] = ELEC6_DCTRACKER_FILTER_FACTOR;
	LPFilterType[6] = ELEC6_LPFILTER_TYPE;
	detectorThresholdTouchDelta[6] = ELEC6_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[6] = ELEC6_RELEASE_THRESHOLD_DELTA;
#endif

#ifdef ELEC7
	// Load electrode 7 hardware data
	elecStruct[7].adcBasePtr = ELEC7_ADC;
	elecStruct[7].adcChNum = ELEC7_ADC_CHANNEL;
	elecStruct[7].portBasePtr = ELEC7_PORT;
	elecStruct[7].gpioBasePtr = ELEC7_GPIO;
	elecStruct[7].pinNumberElec = ELEC7_ELEC_GPIO_PIN;
	elecStruct[7].pinNumberCext = ELEC7_CEXT_GPIO_PIN;
	elecStruct[7].portMask = ELEC7_PORT_MASK;
	// Load electrode 7 application data
	DCTrackerDataShift[7] = ELEC7_DCTRACKER_FILTER_FACTOR;
	LPFilterType[7] = ELEC7_LPFILTER_TYPE;
	detectorThresholdTouchDelta[7] = ELEC7_TOUCH_THRESHOLD_DELTA;
	detectorThresholdReleaseDelta[7] = ELEC7_RELEASE_THRESHOLD_DELTA;
#endif

	// If EGS is OFF and TS method is oversampling
#if !defined(WAKE_UP_ELECTRODE) && TS_RAW_DATA_CALCULATION == OVERSAMPLING
	// All touch button electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Set Threshold delta values to correspond to number of samples taken in Idle state
		detectorThresholdTouchDelta[elecNum] /= NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;
		detectorThresholdReleaseDelta[elecNum] /= NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;
		// Update DC tracker shift
		DCTrackerDataShift[elecNum] = ELEC_DCTRACKER_FILTER_FACTOR_IDLE;
	}
#endif

#ifdef WAKE_UP_ELECTRODE
#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING) || (DECIMATION_FILTER) || (FREQUENCY_HOPPING)
	// All touch button electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Update DC tracker shift
		DCTrackerDataShift[elecNum] = ELEC_DCTRACKER_FILTER_FACTOR_IDLE;
	}
#endif
#endif
}

/*****************************************************************************
 *
 * Function: void ElectrodeADCchannelOffset(void)
 *
 * Description: Fixes ADC channel number in case it is higher than 15
 *
 *****************************************************************************/
void ElectrodeADCchannelOffset(void)
{
	// All electrodes
	for(elecNum = 0; elecNum<NUMBER_OF_ELECTRODES; elecNum++)
	{
		// ADC channel number higher than 15?
		if(elecStruct[elecNum].adcChNum > 15)
		{
			// Add offset
			elecStruct[elecNum].adcChNum += ELECTRODE_ADC_CHANNEL_OFFSET;
		}
	}
}

/*****************************************************************************
 *
 * Function: void ElectrodeTouchSenseInit(void)
 *
 * Description: Init touch sense variables
 *
 *****************************************************************************/
void ElectrodeTouchSenseInit(void)
{
	// Electrodes structure init
	ElectrodeStructureInit();

	// Cext pin ADC channel number correction (in case higher ADC channel number used)
	ElectrodeADCchannelOffset();

	// Electrode and Cext charge distribution period
	chargeDistributionPeriod = 0;

