TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
	// Reset electrodes status
	electrodesStatus.byte = 0;

	// Init LP IIR Filter
	FilterIIR1Init();

	// Reset
	electrodeTouchNumberPlusOne = 0;

	// Reset - report that all touch button electrodes proximity released
	electrodesVirtualEGSTouch = 0;

	// Reset the number of sensing cycles per sample to idle (default)
	numberOfElectrodeSensingCyclesPerSample = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_IDLE;

	// Reset frequencyID
	frequencyID = 0;
}

/*****************************************************************************
 *
 * Function: void ElectrodeCapToVoltConvELCH(uint32_t electrodeNum)
 *
 * Description: Convert electrode capacitance to equivalent voltage
 *
 *****************************************************************************/
void ElectrodeCapToVoltConvELCH(uint32_t electrodeNum)
{
	// Clear ADCs gain (lower noise)
	ClearADCsGain();

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin clear
	R_RMW32(&(DES_GPIO->PCOR), DES_PIN, 1);
#endif

	// Electrode capacitance to voltage conversion
	for (sampleNum = 0; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSample); sampleNum++)
	{
		// Distribute Electrode and Cext charge
		ChargeDistribution(&elecStruct[electrodeNum]);
		// Delay to distribute charge
		chargeDistributionPeriodTmp = chargeDistributionPeriod;
		while (chargeDistributionPeriodTmp) {chargeDistributionPeriodTmp--;}

		// If compiler optimization is not -O3 (is set to none -> -O0), then set TS_ASM_OPTIMIZE macro to 1 in ts_cfg.h
#if(TS_ASM_OPTIMIZE == 1)
		asm volatile (
				/***** ASSEMBLY TEMPLATE ****************************************/
				// Start Cext voltage ADC conversion
				"str %1, [%0, #0]\n\t"    // store %1 to address in %0 with 0 byte offset
				// Redistribute Electrode and Cext charge
				"str %3, [%2, #0]"        // store %3 to address in %2 with 0 byte offset
				/***** LIST OF OUTPUT OPERANDS **********************************/
				:
				/***** LIST OF INPUT OPERANDS ***********************************/
				:  "r" (&elecStruct[electrodeNum].adcBasePtr->SC1[0]),  // operand %0
				   "r" (elecStruct[electrodeNum].adcChNum),             // operand %1
				   "r" (&elecStruct[electrodeNum].gpioBasePtr->PDDR),   // operand %2
				   "r" ((elecStruct[electrodeNum].gpioBasePtr->PDDR) & ~(elecStruct[electrodeNum].portMask))    // operand %3
		);
#else
		// Start Cext voltage ADC conversion
		elecStruct[electrodeNum].adcBasePtr->SC1[0] = elecStruct[electrodeNum].adcChNum;

		// Redistribute Electrode and Cext charge
		ChargeRedistribution(&elecStruct[electrodeNum]);
#endif
		// Equivalent voltage digitalization
		adcDataElectrodeDischargeRawSample[sampleNum] = EquivalentVoltageDigitalization(&elecStruct[electrodeNum]);

#if JITTERING
#if (JITTERING_OPTION == 2)
		// Jitter sample rate
		Jitter(adcDataElectrodeDischargeRaw[electrodeNum][frequencyID]);
#endif
#endif
	}

#if(TS_RAW_DATA_CALCULATION == OVERSAMPLING)
	// Calculate samples sum
	adcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSample); sampleNum++)
	{
		adcDataElectrodeDischargeRawCalc = adcDataElectrodeDischargeRawCalc + adcDataElectrodeDischargeRawSample[sampleNum];
	}
	adcDataElectrodeDischargeRaw[electrodeNum][frequencyID] = adcDataElectrodeDischargeRawCalc;

#elif(TS_RAW_DATA_CALCULATION == AVERAGING)
	// Calculate samples value average
	adcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSample); sampleNum++)
	{
		adcDataElectrodeDischargeRawCalc = adcDataElectrodeDischargeRawCalc + adcDataElectrodeDischargeRawSample[sampleNum];
	}
	adcDataElectrodeDischargeRaw[electrodeNum][frequencyID] = (int32_t)(adcDataElectrodeDischargeRawCalc / numberOfElectrodeSensingCyclesPerSample);
#else
#error Please select valid TS method in ts_cfg_general.h
#endif

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin set
	R_RMW32(&(DES_GPIO->PSOR), DES_PIN, 1);
#endif

	// Set ADCs gain back to calibrated value
	SetADCsGain();
}

/*****************************************************************************
 *
 * Function: void ElectodeBufferInitVal(int32_t inputSignal, int32_t *outputSignalPtr, uint16_t *sumCounterPtr)
 *
 * Description: Sum data
 *
 *****************************************************************************/
void ElectodeBufferInitVal(int32_t inputSignal, int32_t *outputSignalPtr, uint16_t *sumCounterPtr)
{
	int32_t  outputSignal;
	uint16_t sumCounter;


	outputSignal = *outputSignalPtr;
	sumCounter = *sumCounterPtr;

	sumCounter++;
	outputSignal = outputSignal + inputSignal;

	*outputSignalPtr = outputSignal;
	*sumCounterPtr = sumCounter;
}

/*****************************************************************************
 *
 * Function: void ElectodeCalInitVal(int32_t *outputSignalPtr, uint16_t *sumCounterPtr)
 *
 * Description: Calculate data average value
 *
 *****************************************************************************/
void ElectodeCalInitVal(int32_t *outputSignalPtr, uint16_t *sumCounterPtr)
{
	int32_t  outputSignal;
	uint16_t sumCounter;


	outputSignal = *outputSignalPtr;
	sumCounter = *sumCounterPtr;

	outputSignal = outputSignal / sumCounter;

	*outputSignalPtr = outputSignal;
	*sumCounterPtr = TOUCH_SENSE_APP_PWRUP_INIT_DONE;
}

/*****************************************************************************
 *
 * Function: int32_t DCTracker(int32_t inputSignal, int32_t *outputSignalRawPtr, uint8_t shift)
 *
 * Description: DC tracker (baseline) filter
 *
 *****************************************************************************/
int32_t DCTracker(int32_t inputSignal, int32_t *outputSignalRawPtr, uint8_t shift)
{	
	int32_t  outputSignalRaw;


	outputSignalRaw = *outputSignalRawPtr;

	if(inputSignal > (outputSignalRaw >> shift))
	{
		outputSignalRaw = outputSignalRaw + 1;
	}
	else if (inputSignal < (outputSignalRaw >> shift))
	{
		outputSignalRaw = outputSignalRaw - 1;
	}

	*outputSignalRawPtr = outputSignalRaw;

