TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
	return  (outputSignalRaw >> shift);
}
/*****************************************************************************
 *
 * Function: void DCTrackerShiftIncrease(void)
 *
 * Description: DCtrackershift increase
 *
 *****************************************************************************/
void DCTrackerShiftIncrease(void)
{
	// All touch button electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Load new shift to update the DC tracker
		DCTrackerDataShift[elecNum] = ELEC_DCTRACKER_FILTER_FACTOR_ACTIVE;
	}

	// All touch button electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Load DC tracker buffer
		DCTrackerDataBufferRaw[elecNum] = (DCTrackerDataBuffer[elecNum]) << ((DCTrackerDataShift[elecNum]));
	}
}

/*****************************************************************************
 *
 * Function: void DCTrackerShiftDecrease(void)
 *
 * Description: DCtrackershift decrease
 *
 *****************************************************************************/
void DCTrackerShiftDecrease(void)
{
	// All touch button electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Load new shift to update the DC tracker
		DCTrackerDataShift[elecNum] = ELEC_DCTRACKER_FILTER_FACTOR_IDLE;
	}

	// All touch button electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Load DC tracker buffer
		DCTrackerDataBufferRaw[elecNum] = (DCTrackerDataBuffer[elecNum]) << ((DCTrackerDataShift[elecNum]));
	}
}
/*****************************************************************************
 *
 * Function: void ElectrodeSelfTrim(void)
 *
 * Description: Run electrode self-trim algorithm
 *
 *****************************************************************************/
void ElectrodeSelfTrim(void)
{
	// Device after power-up / reset ?
	if (adcDataElectrodeDischargeBufferCounter[0] < NUMBER_OF_CYCLES_DCTRACKER_PWRUP)
	{
		// All touch button (and EGS) electrodes
		for (elecNum = 0; elecNum < (NUMBER_OF_ELECTRODES); elecNum++)
		{
			// Store touch electrode init value
			ElectodeBufferInitVal(adcDataElectrodeDischargeRaw[elecNum][frequencyID], &(adcDataElectrodeDischargeBuffer[elecNum]), &(adcDataElectrodeDischargeBufferCounter[elecNum]));
		}
	}
	// Calculate and load init value
	else
	{
		// All touch button (and EGS) electrodes
		for (elecNum = 0; elecNum < (NUMBER_OF_ELECTRODES); elecNum++)
		{
			// Calculate touch electrode init value
			ElectodeCalInitVal(&(adcDataElectrodeDischargeBuffer[elecNum]), &(adcDataElectrodeDischargeBufferCounter[elecNum]));
		}

		// Set electrode status "self-trim done" flag
		electrodesStatus.bit.selfTrimDone = YES;
	}
}

/*****************************************************************************
 *
 * Function: void electrodeTouchQualify(void)
 *
 * Description: Qualify touch button electrode touch
 *
 *****************************************************************************/
void electrodeTouchQualify(void)
{
	// For all touch button electrodes check touch event
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
#if FREQUENCY_HOPPING
		// Electrode has been touched on both scanning frequencies?
		if ((electrodeTouch[elecNum][0] == 1) && (electrodeTouch[elecNum][1] == 1)  && (electrodeTouchNumberPlusOne == 0) &&
				numberOfElectrodeSensingCyclesPerSample == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_ACTIVE && frequencyID == 1)
#else
			// Electrode has been touched?
			if ((electrodeTouch[elecNum][frequencyID] == 1) && (electrodeTouchNumberPlusOne == 0) &&
					numberOfElectrodeSensingCyclesPerSample == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_ACTIVE)
#endif
			{
				// Report electrode touch
				electrodeTouchQualifiedReport = 1;

				// Report electrode touch
				electrodeTouchQualified[elecNum] = 1;

				// Load electrode number + 1
				electrodeTouchNumberPlusOne = elecNum + 1;
			}

		// Any electrode touched?
		if (electrodeTouchNumberPlusOne != 0)
		{
#if FREQUENCY_HOPPING
			// Electrode, that was touched, has been released on first or second scanning frequency?
			if((electrodeTouch[(electrodeTouchNumberPlusOne - 1)][0] == 0) || (electrodeTouch[(electrodeTouchNumberPlusOne - 1)][1] == 0))
#else
				// Electrode, that was touched, has been released?
				if(electrodeTouch[(electrodeTouchNumberPlusOne - 1)][frequencyID] == 0)
#endif
				{
					// Report electrode release
					electrodeTouchQualifiedReport = 0;
					// Report electrode release
					electrodeTouchQualified[(electrodeTouchNumberPlusOne - 1)] = 0;
					// Reset
					electrodeTouchNumberPlusOne = 0;
				}
		}
	}
}

/*****************************************************************************
 *
 * Function: void ElectrodeTouchDetect(uint32_t electrodeNum)
 *
 * Description: Detect touch button electrode touch
 *
 *****************************************************************************/
void ElectrodeTouchDetect(uint32_t electrodeNum)
{
	// Touch button Electrode touched ?
	if (LPFilterData[electrodeNum][frequencyID] < detectorThresholdTouch[electrodeNum])
	{
		// Touched
		electrodeTouch[electrodeNum][frequencyID] = 1;

#ifdef WAKE_UP_ELECTRODE
		// Load counter to do not return to the wake-up function
		// Do not return to the wake-up function, when electrode released and electrode signal value is above touch and bellow release threshold
		// Expected SR <= 1s
		electrodeWakeUpActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;
#else
		// Load counter to prevent switching of number of samples per cycle to idle
		electrodesVirtualEGSActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;
#endif
	}
	// Electrode released?
	else if ((LPFilterData[electrodeNum][frequencyID] > detectorThresholdRelease[electrodeNum]) && (electrodeTouch[electrodeNum][frequencyID] == 1))
	{
		// Released
		electrodeTouch[electrodeNum][frequencyID] = 0;
	}
}

/*****************************************************************************
 *
 * Function: void ElectrodeSelfTrimSense(void)
 *
 * Description: Electrodes self-trim after power-up or reset
 *
 *****************************************************************************/
void ElectrodeSelfTrimSense(void)
{
#ifdef DEBUG_ALGORITHM
	// Pin clear
	R_RMW32(&(DA_GPIO->PCOR), DA_PIN, 1);
#endif

	// Configure all touch button (and EGS) electrodes floating
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeFloat(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Configure all slider electrodes floating
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		ElectrodeFloat(&sliderElecStruct[elecNum]);
	}
#endif

