TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
	// All touch button (and EGS) electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		// Convert electrode capacitance to equivalent voltage
		ElectrodeCapToVoltConvELCH(elecNum);
	}

	// Drive all touch button (and EGS) electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Drive all slider electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&sliderElecStruct[elecNum]);
	}
#endif

	// All touch button (and EGS) electrodes self trim
	ElectrodeSelfTrim();

	// Electrodes self-trim done?
	if(electrodesStatus.bit.selfTrimDone == YES)
	{
		// All touch button (and EGS) electrodes
		for (elecNum = 0; elecNum < (NUMBER_OF_ELECTRODES); elecNum++)
		{
			// DC tracker data
			DCTrackerDataBuffer[elecNum] = adcDataElectrodeDischargeBuffer[elecNum];
			// Load DC tracker buffer
			DCTrackerDataBufferRaw[elecNum] = (DCTrackerDataBuffer[elecNum]) << ((DCTrackerDataShift[elecNum]));
			// Electrode touch and release thresholds
			detectorThresholdTouch[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdTouchDelta[elecNum];
			detectorThresholdRelease[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdReleaseDelta[elecNum];
		}

		// All (both) used scanning frequencies (freemaster init)
		for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
		{
			// All touch button (and EGS) electrodes
			for (elecNum = 0; elecNum < (NUMBER_OF_ELECTRODES); elecNum++)
			{
				// Touch electrodes LP IIR filter buffer init (FM only)
				LPFilterData[elecNum][frequencyID] = DCTrackerDataBuffer[elecNum];
				// Raw data preset as baseline
				adcDataElectrodeDischargeRaw[elecNum][frequencyID] = DCTrackerDataBuffer[elecNum];

#if DECIMATION_FILTER
				// Pre-load DF array
				adcDataElectrodeDischargeRawDF[elecNum][frequencyID] = DCTrackerDataBuffer[elecNum];
#endif
			}
		}
		// Reset frequencyID
		frequencyID = 0;

		// All (both) used scanning frequencies
		for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
		{
			// All touch button (and EGS) electrodes
			for (elecNum = 0; elecNum < (NUMBER_OF_ELECTRODES); elecNum++)
			{
				// Init IIR filter
				FilterIIR1BufferInit(elecNum, ((tFrac32)(DCTrackerDataBuffer[elecNum])), ((tFrac32)(DCTrackerDataBuffer[elecNum])), frequencyID);
			}
		}
		// Reset frequencyID
		frequencyID = 0;

		// Enable LPTMR
		LPTMR0_Init(LPTMR_ELEC_SENSE);

		// Enable low power mode
		lowPowerModeCtrl = ON;
	}

#ifdef DEBUG_ALGORITHM
	// Pin set
	R_RMW32(&(DA_GPIO->PSOR), DA_PIN, 1);
#endif
}
#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
/*****************************************************************************
 *
 * Function: void ElecOversamplingActivation(void)
 *
 * Description: Activate touch button electrodes DC tracker adjustments for oversampling - to active mode
 *
 *****************************************************************************/
void ElecOversamplingActivation(void)
{
	// All touch button electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Update DC tracker shift
		DCTrackerDataShift[elecNum] = ELEC_DCTRACKER_FILTER_FACTOR_ACTIVE;
	}

	// All touch button electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Set DCTracker value to correspond to number of samples taken in Active state
		DCTrackerDataBuffer[elecNum] = DCTrackerDataBuffer[elecNum] * NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;

		// Load DC tracker buffer
		DCTrackerDataBufferRaw[elecNum] = (DCTrackerDataBuffer[elecNum]) << ((DCTrackerDataShift[elecNum]));
	}

#if DECIMATION_FILTER
	// Save frequencyID
	frequencyIDsave = frequencyID;

	// All (both) used scanning frequencies
	for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
	{
		// All touch button electrodes
		for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
		{
			// Load DF array with DC tracker value - used when oversampling with EGS
			adcDataElectrodeDischargeRawDF[elecNum][frequencyID] = DCTrackerDataBuffer[elecNum];
		}
	}
	// Set back original frequencyID
	frequencyID = frequencyIDsave;
#endif
}

/*****************************************************************************
 *
 * Function: void ElecOversamplingDeactivation(void)
 *
 * Description: Deactivate touch button electrodes DC tracker adjustments for oversampling - back to idle mode
 *
 *****************************************************************************/
void ElecOversamplingDeactivation(void)
{
	// All touch button electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Update DC tracker shift
		DCTrackerDataShift[elecNum] = ELEC_DCTRACKER_FILTER_FACTOR_IDLE;

		// Set DCTracker value to correspond to number of samples taken in Idle state
		DCTrackerDataBuffer[elecNum] = DCTrackerDataBuffer[elecNum] / NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;

		// Load DC tracker buffer
		DCTrackerDataBufferRaw[elecNum] = (DCTrackerDataBuffer[elecNum]) << ((DCTrackerDataShift[elecNum]));

		// Touch electrodes touch and release thresholds
		detectorThresholdTouch[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdTouchDelta[elecNum];
		detectorThresholdRelease[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdReleaseDelta[elecNum];
	}
}
#endif
// Wake up electrode define
#ifdef WAKE_UP_ELECTRODE
/*****************************************************************************
 *
 * Function: void ElectrodeWakeElecSense(void)
 *
 * Description: Sense wake-up (EGS) electrode to detect possible touch event
 *
 *****************************************************************************/
void ElectrodeWakeElecSense(void)
{
#ifdef DEBUG_ALGORITHM
	// Pin clear
	R_RMW32(&(DA_GPIO->PCOR), DA_PIN, 1);
#endif

	// Configure all touch button (and EGS) electrodes floating
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeFloat(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Configure all slider electrodes floating
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		ElectrodeFloat(&sliderElecStruct[elecNum]);
	}
#endif

	// Convert wake-up (EGS) electrode capacitance to equivalent voltage
	ElectrodeCapToVoltConvELCH(WAKE_UP_ELECTRODE);

	// Update Wake-up DC Tracker
	DCTrackerDataBuffer[WAKE_UP_ELECTRODE] = DCTracker(adcDataElectrodeDischargeRaw[WAKE_UP_ELECTRODE][frequencyID], &(DCTrackerDataBufferRaw[WAKE_UP_ELECTRODE]), DCTrackerDataShift[WAKE_UP_ELECTRODE]);
	// Filter Wake-up electrode signal using IIR LP filter
	LPFilterData[WAKE_UP_ELECTRODE][frequencyID] = FilterIIR1(WAKE_UP_ELECTRODE, (tFrac32)(adcDataElectrodeDischargeRaw[WAKE_UP_ELECTRODE][frequencyID]), frequencyID);
	// Wake-up electrode touch & release threshold
	detectorThresholdTouch[WAKE_UP_ELECTRODE] = DCTrackerDataBuffer[WAKE_UP_ELECTRODE] - detectorThresholdTouchDelta[WAKE_UP_ELECTRODE];
	detectorThresholdRelease[WAKE_UP_ELECTRODE] = DCTrackerDataBuffer[WAKE_UP_ELECTRODE] - detectorThresholdReleaseDelta[WAKE_UP_ELECTRODE];

	/*************************************************************************************************
	 Touch button electrodes & slider electrodes slow baseline update routine when wake-up EGS used
	 **************************************************************************************************/
#if SLIDER_ENABLE
	// Update one touch button electrode baseline per wake up period
	if (elecNumAct < (NUMBER_OF_ELECTRODES - 1))
	{
		// Convert touch button electrode capacitance to equivalent voltage
		ElectrodeCapToVoltConvELCH(elecNumAct);
		// DC tracker calculation
		DCTrackerDataBuffer[elecNumAct] = DCTracker(adcDataElectrodeDischargeRaw[elecNumAct][frequencyID], &(DCTrackerDataBufferRaw[elecNumAct]), DCTrackerDataShift[elecNumAct]);
		// Increment to next touch button electrode, that will be updated in next wake up cycle (30ms period)
		elecNumAct++;
	}

	// Update slider electrodes baselines if all touch buttons are updated (elecNumact == WakeUpElectrode)
	else if(elecNumAct == (NUMBER_OF_ELECTRODES - 1) && sliderElecNumAct < (NUMBER_OF_SLIDER_ELECTRODES))
	{
#if (NUMBER_OF_USED_ADC_MODULES == 2)
		// Preset configuration for both ADC0 and ADC1 for voltage digitalization at the same time
		ADCs_SimultaneousHWtrigger();
		// Update both slider electrodes baselines at once
		SliderelectrodeWakeElecSense();
		// Reset configuration for both ADC0 and ADC1 for voltage digitalization one by one
		ADCs_SetBackToSWtrigger();

		// Increment by two slider electrodes
		for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
		{
			sliderElecNumAct++;
		}

#else
		// Update both slider electrodes baselines
		SliderelectrodeWakeElecSense();

		// Increment by two slider electrodes
		for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
		{
			sliderElecNumAct++;
		}
#endif
	}

	else
	{
		// Start from begin
		elecNumAct = 0;
		sliderElecNumAct = 0;
	}

#else
	// Convert touch button electrode capacitance to equivalent voltage
	ElectrodeCapToVoltConvELCH(elecNumAct);
	// DC tracker calculation
	DCTrackerDataBuffer[elecNumAct] = DCTracker(adcDataElectrodeDischargeRaw[elecNumAct][frequencyID], &(DCTrackerDataBufferRaw[elecNumAct]), DCTrackerDataShift[elecNumAct]);

	// Next touch electrode
	if (elecNumAct < (NUMBER_OF_ELECTRODES - 2))
	{
		elecNumAct++;
	}
	else
	{
		// Start from begin
		elecNumAct = 0;
	}
#endif
	/****************************************************************************************************
	END OF Touch button electrodes & slider electrodes slow baseline update routine when wake-up EGS used
	 ****************************************************************************************************/

