TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
	// Drive all touch button (and EGS) electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Drive all slider electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&sliderElecStruct[elecNum]);
	}
#endif

	// Proximity - wake up EGS electrode touched? (frequencyID at this stage of code should always be 0)
	if(LPFilterData[WAKE_UP_ELECTRODE][frequencyID] < detectorThresholdTouch[WAKE_UP_ELECTRODE])
	{
		// Touched
		electrodeTouch[WAKE_UP_ELECTRODE][frequencyID] = 1;

		// Change the number of ADC sensing cycles per sample for touch buttons
		ElectrodeSensingCyclesChangeEGS();

#if SLIDER_ENABLE
		// Change the number of ADC sensing cycles per sample for slider
		SliderSensingCyclesChangeEGS();
#endif

#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
		// Activate touch button electrodes DC tracker adjustments for oversampling - to active mode
		ElecOversamplingActivation();

#if SLIDER_ENABLE
		// Activate slider electrodes DC tracker adjustments for oversampling - to active mode
		SliderElecOversamplingActivation();
#endif
#else
#if DECIMATION_FILTER || FREQUENCY_HOPPING
		// Increase DC tracker Shift to slow down the DC tracker filter
		DCTrackerShiftIncrease();
#if SLIDER_ENABLE
		// Increase DC tracker Shift to slow down the DC tracker filter
		SliderDCTrackerShiftIncrease();
#endif
#endif
#endif

		/* IIR LP Filter Buffer initiation after EGS touch*/

		// Save frequencyID
		frequencyIDsave = frequencyID;

		// All (both) used scanning frequencies
		for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
		{
			// All touch button electrodes
			for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
			{
				// Set IIR filter initial value to (DCTracker - threshold / 2)
				FilterIIR1BufferInit(elecNum, ((tFrac32)(DCTrackerDataBuffer[elecNum] - (detectorThresholdTouchDelta[elecNum] / 2))), \
						((tFrac32)(DCTrackerDataBuffer[elecNum] - (detectorThresholdTouchDelta[elecNum] / 2))), frequencyID);
			}
		}

#if SLIDER_ENABLE
		// All (both) used scanning frequencies
		for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
		{
			// Set IIR filter initial value to (DCTracker - threshold / 2) for slider electrodes
			SliderElectrodeWakeElecFilterLoad();
		}
#endif
		// Set back original frequencyID
		frequencyID = frequencyIDsave;

		// Load counter to do not return to the wake-up function
		// When wake-up happens, 1 second period given to detect touch event
		electrodeWakeUpActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;

		// Sense all touch button and slider electrodes
		ElectrodeWakeAndTouchElecSense();
	}
#ifdef DEBUG_ALGORITHM
	// Pin set
	R_RMW32(&(DA_GPIO->PSOR), DA_PIN, 1);
#endif
}

/*****************************************************************************
 *
 * Function: void ElectrodeWakeAndTouchElecSense(void)
 *
 * Description: Sense all keypad electrodes (all touch button and slider electrodes)
 *
 *****************************************************************************/
void ElectrodeWakeAndTouchElecSense(void)
{
#ifdef DEBUG_ALGORITHM
	// Pin clear
	R_RMW32(&(DA_GPIO->PCOR), DA_PIN, 1);
#endif

	// Configure all touch button (and EGS) electrodes floating
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeFloat(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Configure all slider electrodes floating
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		ElectrodeFloat(&sliderElecStruct[elecNum]);
	}
#endif

	// All touch button electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Convert touch button electrode capacitance to equivalent voltage
		ElectrodeCapToVoltConvELCH(elecNum);

		// Update DC Tracker, if electrode not touched
		if (electrodeTouch[elecNum][frequencyID] == 0)
		{
			// Update DC tracker
			DCTrackerDataBuffer[elecNum] = DCTracker(adcDataElectrodeDischargeRaw[elecNum][frequencyID], &(DCTrackerDataBufferRaw[elecNum]), DCTrackerDataShift[elecNum]);
		}
#if DECIMATION_FILTER
		// Decimation filtering
		DecimationFilter(elecNum);
#endif

#if DECIMATION_FILTER
		// IIR LP Filter fed by DF data
		LPFilterData[elecNum][frequencyID] = FilterIIR1(elecNum, (tFrac32)(adcDataElectrodeDischargeRawDF[elecNum][frequencyID]), frequencyID);
#else
		// IIR LP filter fed by raw data
		LPFilterData[elecNum][frequencyID] = FilterIIR1(elecNum, (tFrac32)(adcDataElectrodeDischargeRaw[elecNum][frequencyID]), frequencyID);
#endif

		// Electrode touch and release thresholds
		detectorThresholdTouch[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdTouchDelta[elecNum];
		detectorThresholdRelease[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdReleaseDelta[elecNum];

		// Electrode touched ?
		ElectrodeTouchDetect(elecNum);
	}

	// Drive all touch button (and EGS) electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Drive all slider electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&sliderElecStruct[elecNum]);
	}
#endif

	// Qualify the touch event
	// More the one electrode reports touch?
	electrodeTouchQualify();

#if SLIDER_ENABLE
#if (NUMBER_OF_USED_ADC_MODULES == 2)
	// Preset configuration for both ADC0 and ADC1 for voltage digitalization at the same time
	ADCs_SimultaneousHWtrigger();
	// Sense electrode touch event at slider electrodes
	SliderElectrodesTouchElecSense();
	// Reset configuration for both ADC0 and ADC1 for voltage digitalization one by one
	ADCs_SetBackToSWtrigger();
#else
	// Sense electrode touch event at slider electrodes
	SliderElectrodesTouchElecSense();
#endif
#endif

	// Release to wake-up electrode control
	if (electrodeWakeUpActivateCounter == 0)
	{
		// Released
		electrodeTouch[WAKE_UP_ELECTRODE][0] = 0;

