TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
		// Deactivate touch button electrodes DC tracker adjustments for oversampling - back to idle mode
		ElecOversamplingDeactivation();

#if SLIDER_ENABLE
		// Deactivate slider electrodes DC tracker adjustments for oversampling - back to idle mode
		SliderElecOversamplingDeactivation();
#endif
#else
#if DECIMATION_FILTER || FREQUENCY_HOPPING
		// Decrease DC tracker Shift to speed up the DC tracker filter
		DCTrackerShiftDecrease();
#if SLIDER_ENABLE
		// Decrease DC tracker Shift to speed up the DC tracker filter
		SliderDCTrackerShiftDecrease();
#endif
#endif
#endif

		// Change the number of ADC sensing cycles per sample (for touch buttons)
		ElectrodeSensingCyclesChangeEGS();

#if SLIDER_ENABLE
		// Change the number of ADC sensing cycles per sample (for slider)
		SliderSensingCyclesChangeEGS();
#endif

		/* IIR LP Filter Buffer of EGS reset after EGS release*/

		// Save frequencyID
		frequencyIDsave = frequencyID;

		// All (both) used scanning frequencies
		for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
		{
			// Load wake-up electrode IIR1 LP Filter buffer (X, Y) with DC tracker value
			FilterIIR1BufferInit(WAKE_UP_ELECTRODE, ((tFrac32)(DCTrackerDataBuffer[WAKE_UP_ELECTRODE])), (((tFrac32)(DCTrackerDataBuffer[WAKE_UP_ELECTRODE]))),frequencyID);
		}
		// Set back original frequencyID
		frequencyID = frequencyIDsave;
	}
	else
	{
#if FREQUENCY_HOPPING
		// Decrement wake up counter only during core period/frequency (30 ms)
		if(frequencyID == 0)
#endif
		{
			// Decrement counter
			electrodeWakeUpActivateCounter--;
		}
	}

#ifdef DEBUG_ALGORITHM
	// Pin set
	R_RMW32(&(DA_GPIO->PSOR), DA_PIN, 1);
#endif
}
/*****************************************************************************
 *
 * Function: void ElectrodeSensingCyclesChangeEGS(void)
 *
 * Description: Changes the number of sensing cycles per sample based on whether the proximity EGS was touched
 *
 *****************************************************************************/
void ElectrodeSensingCyclesChangeEGS(void)
{
	if(electrodeTouch[WAKE_UP_ELECTRODE][0] == 1)
	{
		// Change the number of touch buttons sensing cycles per sample to active
		numberOfElectrodeSensingCyclesPerSample = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_ACTIVE;
	}
	else
	{
		// Change the number of touch buttons sensing cycles per sample to idle
		numberOfElectrodeSensingCyclesPerSample = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_IDLE;
	}
}

// Wake up electrode define
#else

/*****************************************************************************
 *
 * Function: void ElectrodeTouchElecSense(void)
 *
 * Description: Sense all touch button electrodes
 *
 *****************************************************************************/
void ElectrodeTouchElecSense(void)
{
#ifdef DEBUG_ALGORITHM
	// Pin clear
	R_RMW32(&(DA_GPIO->PCOR), DA_PIN, 1);
#endif

	// Configure all touch button (and EGS) electrodes floating
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeFloat(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Configure all slider electrodes floating
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		ElectrodeFloat(&sliderElecStruct[elecNum]);
	}
#endif

	// All touch button electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
	{
		// Convert electrode capacitance to equivalent voltage
		ElectrodeCapToVoltConvELCH(elecNum);

		// Update DC Tracker, if electrode not touched
		if (electrodeTouch[elecNum][frequencyID] == 0)
		{
			// Update DC Tracker
			DCTrackerDataBuffer[elecNum] = DCTracker(adcDataElectrodeDischargeRaw[elecNum][frequencyID], &(DCTrackerDataBufferRaw[elecNum]), DCTrackerDataShift[elecNum]);
		}

#if DECIMATION_FILTER
		// Decimation filtering
		DecimationFilter(elecNum);
#endif

#if DECIMATION_FILTER
		// IIR LP Filter fed by DF data
		LPFilterData[elecNum][frequencyID] = FilterIIR1(elecNum, (tFrac32)(adcDataElectrodeDischargeRawDF[elecNum][frequencyID]), frequencyID);
#else
		// IIR LP filter fed by raw data
		LPFilterData[elecNum][frequencyID] = FilterIIR1(elecNum, (tFrac32)(adcDataElectrodeDischargeRaw[elecNum][frequencyID]), frequencyID);
#endif

		// Calculate electrode touch and release thresholds
		detectorThresholdTouch[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdTouchDelta[elecNum];
		detectorThresholdRelease[elecNum] = DCTrackerDataBuffer[elecNum] - detectorThresholdReleaseDelta[elecNum];

		// Electrode touched ?
		ElectrodeTouchDetect(elecNum);

	}

	// Drive all touch button (and EGS) electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&elecStruct[elecNum]);
	}

#if SLIDER_ENABLE
	// Drive all slider electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&sliderElecStruct[elecNum]);
	}
#endif

	// Qualify the touch event
	// More the one electrode reports touch?
	electrodeTouchQualify();

#ifdef DEBUG_ALGORITHM
	// Pin set
	R_RMW32(&(DA_GPIO->PSOR), DA_PIN, 1);
#endif

}

/*****************************************************************************
 *
 * Function: void ElectrodeSensingCyclesChange(void)
 *
 * Description: Changes the number of sensing cycles per sample for touch buttons based on detected proximity on touch buttons
 *
 *****************************************************************************/
void ElectrodeSensingCyclesChange(void)
{
	uint8_t electrodeNum;

	// Detect if any of the button electrodes was reported as proximately touched
	for(electrodeNum = 0; electrodeNum < NUMBER_OF_TOUCH_ELECTRODES; electrodeNum++)
	{
#if FREQUENCY_HOPPING
		// If on both frequencies proximity detected
		if((LPFilterData[electrodeNum][0] < (DCTrackerDataBuffer[electrodeNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA)) &&  \
				(LPFilterData[electrodeNum][1] < (DCTrackerDataBuffer[electrodeNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA)))
#else
			// If proximity detected
			if(LPFilterData[electrodeNum][frequencyID] < (DCTrackerDataBuffer[electrodeNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA))
#endif
			{
				// Report wake up
				electrodesVirtualEGSActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;

				// If this is first touch
				if (electrodesVirtualEGSTouch != 1)
				{
					// Report that some of the touch button electrodes proximately touched
					electrodesVirtualEGSTouch = 1;

