TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
					// Activate the oversampling just once after first confirmed proximity
					if(electrodesOversamplingActivationReport != 1)
					{
						// Activate touch button electrodes DC tracker adjustments for oversampling - to active mode
						ElecOversamplingActivation();

						// Report electrodes Oversampling activation done
						electrodesOversamplingActivationReport = 1;

						// All touch button electrodes
						for(elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
						{
							// Set Threshold delta values to correspond to number of samples taken in Active state
							detectorThresholdTouchDelta[elecNum] *= NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;
							detectorThresholdReleaseDelta[elecNum] *= NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;
						}
						// Save frequencyID
						frequencyIDsave = frequencyID;

						// All (both) used scanning frequencies
						for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
						{

							// All touch button electrodes
							for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
							{
								// Load IIR1 LP Filter buffer (X, Y) exactly with corresponding value
								FilterIIR1BufferInit(elecNum, ((tFrac32)(DCTrackerDataBuffer[elecNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA)), \
										((tFrac32)(DCTrackerDataBuffer[elecNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA)),frequencyID);
							}
						}
						// Set back original frequencyID
						frequencyID = frequencyIDsave;

#if DECIMATION_FILTER
						// Save frequencyID
						frequencyIDsave = frequencyID;

						// All (both) used scanning frequencies
						for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
						{

							// All touch button electrodes
							for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
							{
								// Load DF array exactly with corresponding value
								adcDataElectrodeDischargeRawDF[elecNum][frequencyID]= DCTrackerDataBuffer[elecNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA;
							}
						}
						// Set back original frequencyID
						frequencyID = frequencyIDsave;
#endif
					}
#endif
					// Change the number of touch buttons sensing cycles per sample to active
					numberOfElectrodeSensingCyclesPerSample = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_ACTIVE;

				}
				// Exit the for loop
				break;
			}

			else
			{
				// Came to the last touch button electrode (did not manage to escape the for loop so far)
				if(electrodeNum == (NUMBER_OF_TOUCH_ELECTRODES - 1))
				{
					// Wake up counter finished counting?
					if(electrodesVirtualEGSActivateCounter == 0)
					{
						// Report that all touch button electrodes proximity released
						electrodesVirtualEGSTouch = 0;

#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
						// De-activate the oversampling just once after first confirmed proximity release
						if(electrodeNum == (NUMBER_OF_TOUCH_ELECTRODES-1) && electrodesOversamplingActivationReport == 1)
						{
							// Deactivate touch button electrodes DC tracker adjustments for oversampling - back to idle mode
							ElecOversamplingDeactivation();

							// All touch button electrodes
							for(elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
							{
								// Set Threshold delta values to correspond to number of samples taken in Idle state
								detectorThresholdTouchDelta[elecNum] /= NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;
								detectorThresholdReleaseDelta[elecNum] /= NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_MULTIPLY;
							}

							// Save frequencyID
							frequencyIDsave = frequencyID;

							// All (both) used scanning frequencies
							for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
							{

								// All touch button electrodes
								for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
								{
									// Load IIR1 LP Filter buffer (X, Y) with DC tracker value
									FilterIIR1BufferInit(elecNum, ((tFrac32)(DCTrackerDataBuffer[elecNum])), (((tFrac32)(DCTrackerDataBuffer[elecNum]))),frequencyID);
								}
							}
							// Set back original frequencyID
							frequencyID = frequencyIDsave;

							// Report electrodes Oversampling De-activation done
							electrodesOversamplingActivationReport = 0;

#if DECIMATION_FILTER
							// Save frequencyID
							frequencyIDsave = frequencyID;

							// All (both) used scanning frequencies
							for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
							{

								// All touch button electrodes
								for (elecNum = 0; elecNum < NUMBER_OF_TOUCH_ELECTRODES; elecNum++)
								{
									// Load DF array with new DC tracker value
									adcDataElectrodeDischargeRawDF[elecNum][frequencyID]= DCTrackerDataBuffer[elecNum];
								}
							}
							// Set back original frequencyID
							frequencyID = frequencyIDsave;
#endif
						}
#endif

						// Change the number of touch buttons sensing cycles per sample to idle
						numberOfElectrodeSensingCyclesPerSample = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_IDLE;
					}
					else
					{
						// Decrement wake up activate counter
						if(electrodesVirtualEGSActivateCounter != 0)
						{
							electrodesVirtualEGSActivateCounter--;
						}
					}
				}
			}
	}
}

// Wake up electrode define
#endif

#if FREQUENCY_HOPPING
/*****************************************************************************
 *
 * Function: void FrequencyHop(void)
 *
 * Description: Changes scanning frequency/period of electrodes samples
 *
 *****************************************************************************/
void FrequencyHop(void)
{
#ifdef WAKE_UP_ELECTRODE
	// If EGS touched
	if(electrodeTouch[WAKE_UP_ELECTRODE][0] == 1)
#else
		// Frequency hopping all the time
		if(1)
#endif
		{
			// Report FH activation for touch qualification
			frequencyHoppingActivation = 1;

			// Period/Frequency switching
			switch (frequencyID)
			{
			case 0:
			{
				// Report switch of scanning frequency/period
				frequencyID = 1;
				break;
			}

			case 1:
			{
				// Report switch of scanning frequency/period back to normal(core period 30 ms)
				frequencyID = 0;
				break;
			}
			}

