TomasIvan/S32K144_TouchSense_SDK/S32K144_TS_40/TS Project/ets.c
		}
		else
		{
			// Report FH DEactivation
			frequencyHoppingActivation = 0;

			// Report switch of scanning frequency/period back to normal(core period 30 ms)
			frequencyID = 0;
		}
}

#endif

#if DECIMATION_FILTER
/*****************************************************************************
 *
 * Function: void DecimationFilter(uint32_t electrodeNum)
 *
 * Description: Increment or decrement decimation filter value
 *
 *****************************************************************************/
void DecimationFilter(uint32_t electrodeNum)
{

	// Is the electrode raw data value still smaller than electrode decimation filter value?
	if(adcDataElectrodeDischargeRaw[electrodeNum][frequencyID] < adcDataElectrodeDischargeRawDF[electrodeNum][frequencyID])
	{
		// Decrement DF value - follow the raw data down
		adcDataElectrodeDischargeRawDF[electrodeNum][frequencyID] -= DECIMATION_STEP ;
	}
	// Is the electrode raw data value same as electrode decimation filter value?
	else if ((adcDataElectrodeDischargeRaw[electrodeNum][frequencyID] == adcDataElectrodeDischargeRawDF[electrodeNum][frequencyID]))
	{
		// Do nothing
	}

	else
	{
		// Increment DF value - follow  the raw data back up to the baseline
		adcDataElectrodeDischargeRawDF[electrodeNum][frequencyID] += DECIMATION_STEP;
	}

}
/*****************************************************************************
 *
 * Function: void DecimationFilterCMRchangeEGS(void)
 *
 * Description: Sets new timeout period of LPTMR if decimation filter is used
 *
 *****************************************************************************/
void DecimationFilterCMRchange(void)
{
#ifdef WAKE_UP_ELECTRODE
	// If EGS touched
	if(electrodeTouch[WAKE_UP_ELECTRODE][0] == 1)
#else
		// Decimation filtering all the time
		if(1)
#endif
		{
			// Set LPTMR timeout period of decimation filter (3ms)
			LPTMR0->CMR = LPTMR_ELEC_SENSE_DF;
		}
		else
		{
			// Set LPTMR 30 ms timeout period
			LPTMR0->CMR = LPTMR_ELEC_SENSE;
		}
}

#endif
